==================
Simple struct definition
==================

struct mystruct {
u32 ident;
};

---
(source_file
  (struct_definition
    name: (identifier)
    body: (field_list
      (variable_definition
        type: (primitive_type)
        name: (identifier)))
  )
)

==================
Multi field struct definition
==================

struct mystruct {
u32 ident;
auto ident2;
};

---
(source_file
  (struct_definition
    name: (identifier)
    body: (field_list
      (variable_definition
        type: (primitive_type)
        name: (identifier))
      (variable_definition
        type: (primitive_type)
        name: (identifier)))))

==================
Multi identifier struct definition
==================

struct mystruct {
u32 ident, ident2;
};

---
(source_file
  (struct_definition
    name: (identifier)
    body: (field_list
      (variable_definition
        type: (primitive_type)
        name: (identifier)
        name: (identifier))))
)

==================
With endian indicator
==================

struct mystruct {
le u32 ident, ident2;
};

---
(source_file
  (struct_definition
    name: (identifier)
    body: (field_list
      (variable_definition
        endian: (endian_indicator)
        type: (primitive_type)
        name: (identifier)
        name: (identifier))))
)

==================
With dollar sign
==================

struct mystruct {
    u8 ident;
    $ = $ + 15;
    u32 ident;
};

---
(source_file
  (struct_definition
    name: (identifier)
    body: (field_list
      (variable_definition
        type: (primitive_type)
        name: (identifier))
      (assignation_statement
        (dollar)
        (binary_numeric_operator
          left: (dollar)
          right: (number_literal)))
      (variable_definition
        type: (primitive_type)
        name: (identifier))
    )
  )
)
